blueskycoco/moto/src/tm4c123/moto.c
//*****************************************************************************
//
// uart_echo.c - Example for reading data from and writing data to the UART in
//               an interrupt driven fashion.
//
// Copyright (c) 2012-2015 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.2.111 of the EK-TM4C123GXL Firmware Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"
#include "utils/cmdline.h"

#include "cspin.h"
#include "l6480.h"
static char g_cInput[256];

cSPIN_RegsStruct_TypeDef cSPIN_RegsStructArray[NUMBER_OF_SLAVES];
double   MAX_SPEED[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_MAX_SPEED;

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define DELAY_COUNT    0x3FFFF
uint8_t number_of_slaves = NUMBER_OF_SLAVES;
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint32_t i;        
uint8_t commandArray[NUMBER_OF_SLAVES];
uint32_t argumentArray[NUMBER_OF_SLAVES];
uint32_t responseArray[NUMBER_OF_SLAVES];
/* straight forward definitions */
double   ACC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_ACC;
double   DEC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_DEC;
double   FS_SPD[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_FS_SPD;
uint8_t  ALARM_EN[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_ALARM_EN;
uint8_t  OCD_TH[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_OCD_TH;
/* OR-ed definitions */
uint8_t  STEP_MODE[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_STEP_MODE;
uint8_t  SYNC_MODE[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_SYNC_MODE;
uint16_t GATECFG1_WD_EN[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_WD_EN;
uint16_t GATECFG1_TBOOST[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_TBOOST;
uint16_t GATECFG1_IGATE[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_IGATE;
uint16_t GATECFG1_TCC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_TCC;
uint8_t  GATECFG2_TBLANK[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_TBLANK;
uint8_t  GATECFG2_TDT[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_TDT;
uint16_t CONFIG_CLOCK_SETTING[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_CLOCK_SETTING;
uint16_t CONFIG_SW_MODE[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_SW_MODE;   
uint16_t CONFIG_OC_SD[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_OC_SD;
uint16_t CONFIG_UVLOVAL[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_UVLOVAL;
uint16_t CONFIG_VCCVAL[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_VCCVAL;
/* straight forward definitions */
double   KVAL_HOLD[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_KVAL_HOLD;
double   KVAL_RUN[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_KVAL_RUN;
double   KVAL_ACC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_KVAL_ACC;
double   KVAL_DEC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_KVAL_DEC;
double   INT_SPD[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_INT_SPD;
double   ST_SLP[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_ST_SLP;
double   FN_SLP_ACC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_FN_SLP_ACC;
double   FN_SLP_DEC[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_FN_SLP_DEC;
double   K_THERM[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_K_THERM;
double   STALL_TH[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_STALL_TH;
/* OR-ed definitions */
double   MIN_SPEED[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_MIN_SPEED;
uint16_t LSPD_BIT[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_LSPD_BIT;
uint16_t CONFIG_VS_COMP[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_VS_COMP;
uint16_t CONFIG_PWM_DIV[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_PWM_DIV;
uint16_t CONFIG_PWM_MUL[NUMBER_OF_SLAVES] = cSPIN_DC_CONF_PARAM_PWM_MUL;
bool pOpenA[1];
bool pOpenB[1];
uint32_t cSPIN_rx_data = 0;
cSPIN_RegsStruct_TypeDef cSPIN_RegsStruct;

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>UART Echo (uart_echo)</h1>
//!
//! This example application utilizes the UART to echo text.  The first UART
//! (connected to the USB debug virtual serial port on the evaluation board)
//! will be configured in 115,200 baud, 8-n-1 mode.  All characters received on
//! the UART are transmitted back to the UART.
//
//*****************************************************************************

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// The UART interrupt handler.
//
//*****************************************************************************
void
UARTIntHandler(void)
{
    uint32_t ui32Status;

    //
    // Get the interrrupt status.
    //
    ui32Status = ROM_UARTIntStatus(UART0_BASE, true);

    //
    // Clear the asserted interrupts.
    //
    ROM_UARTIntClear(UART0_BASE, ui32Status);

    //
    // Loop while there are characters in the receive FIFO.
    //
    while(ROM_UARTCharsAvail(UART0_BASE))
    {
        //
        // Read the next character from the UART and write it back to the UART.
        //
        ROM_UARTCharPutNonBlocking(UART0_BASE,
                                   ROM_UARTCharGetNonBlocking(UART0_BASE));

        //
        // Blink the LED to show a character transfer is occuring.
        //
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);

        //
        // Delay for 1 millisecond.  Each SysCtlDelay is about 3 clocks.
        //
        SysCtlDelay(SysCtlClockGet() / (1000 * 3));

        //
        // Turn off the LED
        //
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);

