blueskycoco/moto/src/tm4c123/moto.c
    }
}

//*****************************************************************************
//
// Send a string to the UART.
//
//*****************************************************************************
void
UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count)
{
    //
    // Loop while there are more characters to send.
    //
    while(ui32Count--)
    {
        //
        // Write the next character to the UART.
        //
        ROM_UARTCharPutNonBlocking(UART0_BASE, *pui8Buffer++);
    }
}
void auto_mtest(void)
{
	int i;
    if (number_of_slaves > 1)
    {
      /* Initialization of command array with NOP instruction */
      for (i=0;i<number_of_slaves;i++)
      {
        commandArray[i] = cSPIN_NOP; 
      }

      /* Move DEVICE 1, keep other slaves stopped */
      cSPIN_One_Slave_Move(DEVICE_1, number_of_slaves, FWD, 150000);
     
      /* Wait until not busy - busy pin test */
      while(cSPIN_Busy_HW());

      /* Move DEVICE 1, keep other slaves stopped */
      cSPIN_One_Slave_Move(DEVICE_2, number_of_slaves, FWD, 60000);
     
      /* Wait until not busy - busy pin test */
      while(cSPIN_Busy_HW());
    
      /* Move DEVICE 1 by 60000 steps in reverse direction */
      /* Run DEVICE 2 at 400 steps/s in forward direction */
      /* No operation for other slaves */
      commandArray[DEVICE_1] = (uint8_t) cSPIN_MOVE |(uint8_t) REV;
      argumentArray[DEVICE_1] = 60000;
      commandArray[DEVICE_2] = (uint8_t) cSPIN_RUN |(uint8_t) FWD;
      argumentArray[DEVICE_2] = Speed_Steps_to_Par(400);
      cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);

      /* Wait until not busy - busy pin test */
      /* DEVICE 1 and DEVICE 2 turns in opposite directions */
      while(cSPIN_Busy_HW());

      /* Wait few seconds - DEVICE 1 is stopped, DEVICE 2 turns forward */
      cSPIN_Delay(0x00FFFFFF);

      /* Move DEVICE 1 to HOME position via the shortest path */
      /* Run DEVICE 2 at 150 steps/s in reverse direction */
      /* No operation for other slaves */
      commandArray[DEVICE_1] = (uint8_t) cSPIN_GO_HOME;
      commandArray[DEVICE_2] = (uint8_t) cSPIN_RUN |(uint8_t) REV;
      argumentArray[DEVICE_2] = Speed_Steps_to_Par(150);
      cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);          
      
      /* Wait until not busy - busy pin test */
      /* DEVICE 1 goes to zero position, turning reverse in this example */
      /* DEVICE 2 changes direction to turn reverse */
      while(cSPIN_Busy_HW());        

      /* Wait few seconds - DEVICE 1 is stopped, DEVICE 2 turns reverse */
      cSPIN_Delay(0x00FFFFFF);
    
      /* No change for DEVICE 1 */
      /* Stop DEVICE 2 */
      /* No operation for other slaves */
      commandArray[DEVICE_1] = cSPIN_NOP;
      commandArray[DEVICE_2] = cSPIN_SOFT_STOP;         
      cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);
    
      /* Wait until not busy - busy pin test */
      while(cSPIN_Busy_HW());
    }
        else /* (number_of_slaves > 1) */
        {
          /* Move by 60,000 steps rorward, range 0 to 4,194,303 */
          cSPIN_One_Slave_Move(number_of_slaves, DEVICE_1, FWD, 60000);
	
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
	
/* Send cSPIN command change hold duty cycle to 0.5% */
          commandArray[DEVICE_1] = cSPIN_KVAL_HOLD;
          argumentArray[DEVICE_1] = Kval_Perc_to_Par(0.5);
          cSPIN_All_Slaves_Set_Param(number_of_slaves, commandArray, argumentArray);
	
          /* Send cSPIN command change run duty cycle to 5% */
          commandArray[DEVICE_1] = cSPIN_KVAL_RUN;
          argumentArray[DEVICE_1] = Kval_Perc_to_Par(5);
          cSPIN_All_Slaves_Set_Param(number_of_slaves, commandArray, argumentArray);        

          /* Run constant speed of 50 steps/s reverse direction */
          cSPIN_One_Slave_Run(DEVICE_1, number_of_slaves, REV, Speed_Steps_to_Par(50));

          /* Wait few seconds - motor turns */
          cSPIN_Delay(0x00FFFFFF);
	
          /* Perform SoftStop commmand */
          commandArray[DEVICE_1] = cSPIN_SOFT_STOP;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
          /* RESET KVAL_HOLD to initial value */
          commandArray[DEVICE_1] = cSPIN_KVAL_HOLD;
          argumentArray[DEVICE_1] = cSPIN_RegsStructArray[DEVICE_1].KVAL_HOLD;
          cSPIN_All_Slaves_Set_Param(number_of_slaves, commandArray, argumentArray);
	
          /* RESET KVAL_RUN to initial value */
          commandArray[DEVICE_1] = cSPIN_KVAL_RUN;
          argumentArray[DEVICE_1] = cSPIN_RegsStructArray[DEVICE_1].KVAL_RUN;
          cSPIN_All_Slaves_Set_Param(number_of_slaves, commandArray, argumentArray);

          /* Wait until not busy - busy status check in Status register */
          while(cSPIN_Busy_SW());
	
          /* Move by 100,000 steps forward, range 0 to 4,194,303 */
          cSPIN_One_Slave_Move(DEVICE_1, number_of_slaves, FWD, (uint32_t)(100000));        
	
          /* Wait until not busy */
          while(cSPIN_One_Or_More_Slaves_Busy_SW(number_of_slaves));
	
          /* Test of the Flag pin by polling, wait in endless cycle if problem is detected */
          if(cSPIN_Flag()) while(1);
	
          /* Issue cSPIN Go Home command */
          commandArray[DEVICE_1] = (uint8_t) cSPIN_GO_HOME;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);

          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
	
          /* Issue cSPIN Go To command */
          commandArray[DEVICE_1] = cSPIN_GO_TO;
          argumentArray[DEVICE_1] = 0x0000FFFF;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
	
          /* Issue cSPIN Go To command */
          commandArray[DEVICE_1] = (uint8_t)cSPIN_GO_TO_DIR | (uint8_t)FWD;
          argumentArray[DEVICE_1] = 0x0001FFFF;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
          /* Read run duty cycle (cSPIN_KVAL_RUN) parameter from cSPIN */
          commandArray[DEVICE_1] = cSPIN_KVAL_RUN;
          cSPIN_All_Slaves_Get_Param(number_of_slaves, commandArray, responseArray);

          /* Read intersect speed (cSPIN_INT_SPD) parameter from cSPIN */
          commandArray[DEVICE_1] = cSPIN_INT_SPD;
          cSPIN_All_Slaves_Get_Param(number_of_slaves, commandArray, responseArray);

          /* Read Status register content */
          cSPIN_All_Slaves_Get_Status(number_of_slaves, responseArray);
	
          /* Read absolute position (cSPIN_ABS_POS) parameter from cSPIN */
          commandArray[DEVICE_1] = cSPIN_ABS_POS;
          cSPIN_All_Slaves_Get_Param(number_of_slaves, commandArray, responseArray);

          /* Reset position counter */
          commandArray[DEVICE_1] = cSPIN_RESET_POS;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);   

          /* Read absolute position (cSPIN_ABS_POS) parameter from cSPIN */
          commandArray[DEVICE_1] = cSPIN_ABS_POS;
          cSPIN_All_Slaves_Get_Param(number_of_slaves, commandArray, responseArray);

