blueskycoco/moto/src/tm4c123/moto.c
          /* Issue cSPIN Hard HiZ command - disable power stage (High Impedance) */
          commandArray[DEVICE_1] = cSPIN_HARD_HIZ;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
 
          /********************************************************************/
          /* Start example of GoUntil Command */
          /********************************************************************/
          /* Configure Interrupt for switch motor in case the MCU is used to pilot the switch */
          //cSPIN_Switch_Motor_Interrupt_Config();
          /* Motion in FW direction at speed 400steps/s via GoUntil command*/
          /* When SW is closed:  */
          /*    As ACT is set ot ACTION_COPY, ABS_POS is saved to MARK register */
          /*    then a soft stop is done          */
          commandArray[DEVICE_1] = (uint8_t)cSPIN_GO_UNTIL | (uint8_t)ACTION_COPY | (uint8_t)FWD;
          argumentArray[DEVICE_1] = Speed_Steps_to_Par(400);
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, argumentArray);
        
          /* Waiting for soft Stop after GoUntil command*/
          while(cSPIN_Busy_HW())
          /* User action needed to go further */
          /* User attention drawn by toggling a LED */
  

          /* Move by 50,000 steps in reverse direction, range 0 to 4,194,303 */
          cSPIN_One_Slave_Move(DEVICE_1, number_of_slaves, REV, (uint32_t)(50000));
       
          /* Waiting for end of move command*/
          while(cSPIN_Busy_HW());
        
          /* Go to Mark saved with GoUntil command */
          commandArray[DEVICE_1] = cSPIN_GO_MARK;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
        
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
        
          /********************************************************************/
          /* End example of GoUntil Command */
          /********************************************************************/
        
          cSPIN_Delay(0x00FFFFFF);
        
          /********************************************************************/
          /* Start example of ReleaseSw Command */
          /********************************************************************/
          /* Motion via cSPIN_Release_SW command in REV direction at minimum speed*/
          /* (or  5 steps/s is minimum speed is < 5step/s)*/
          /* When SW is opened:  */
          /*    As ACT is set ot ACTION_RESET, ABS_POS is reset i.e Home position is set */
          /*    then a soft stop is done          */
          commandArray[DEVICE_1] = (uint8_t)cSPIN_RELEASE_SW | (uint8_t)ACTION_RESET | (uint8_t)REV;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);          
        
          /* Waiting for soft Stop after ReleaseSw command*/
          while(cSPIN_Busy_HW())
          /* User action needed to go further */
          /* User attention drawn by toggling a LED */


          /* Move by 100,000 steps forward, range 0 to 4,194,303 */
          cSPIN_One_Slave_Move(DEVICE_1, number_of_slaves, FWD, (uint32_t)(100000));
       
          /* Waiting for end of move command*/
          while(cSPIN_Busy_HW());
        
          /* Go to Home set with ReleaseSW command */
          commandArray[DEVICE_1] = (uint8_t) cSPIN_GO_HOME;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
        
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
          /********************************************************************/
          /* End example of ReleaseSw Command */
          /********************************************************************/
    
          /********************************************************************/
          /* Start example of StepClock Command */
          /********************************************************************/
        
          /* Enable Step Clock Mode */
          commandArray[DEVICE_1] = (uint8_t)cSPIN_STEP_CLOCK | (uint8_t)FWD;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
        
          /* Set PWM period to 500 so PWM Frequency = 1MHz/ 500 = 2KHz */
          /* and so, motor moves at 2000 steps/s */
          cSPIN_PWM_Enable(500);
          cSPIN_Delay(0x00FFFFFF);
          cSPIN_PWM_DISABLE();
        
          /* Get Status to clear FLAG due to step clock mode */
          cSPIN_All_Slaves_Get_Status(number_of_slaves, responseArray);
        
          /********************************************************************/
          /* End example of StepClock Command */
          /********************************************************************/

          /********************************************************************/
          /* Start example of FLAG interrupt management */
          /********************************************************************/
          /* Interrupt configuration for FLAG signal */
          //cSPIN_Flag_Interrupt_GPIO_Config();
          /* Run constant speed of 400 steps/s forward direction */
          cSPIN_One_Slave_Run(DEVICE_1, number_of_slaves, FWD, Speed_Steps_to_Par(400));        
        
          /* Tentative to write to the current motor absolute position register */
          /* while the motor is running */
          commandArray[DEVICE_1] = cSPIN_ABS_POS;
          argumentArray[DEVICE_1] = 100;
          cSPIN_All_Slaves_Set_Param(number_of_slaves, commandArray, argumentArray);       
          cSPIN_Delay(0x00FFFFFF);
          /* Get Status to clear FLAG due to non-performable command */
          cSPIN_All_Slaves_Get_Status(number_of_slaves, responseArray);
          /* Perform SoftStop commmand */
          commandArray[DEVICE_1] = cSPIN_SOFT_STOP;
          cSPIN_All_Slaves_Send_Command(number_of_slaves, commandArray, 0);
          /* Wait until not busy - busy pin test */
          while(cSPIN_Busy_HW());
          /********************************************************************/
          /* End example of FLAG interrupt management */
          /********************************************************************/
      
